iPig/src/Reports/КартаПлодовитости/КартаПлодовитости.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>КартаПлодовитости</name>
  <attributes>
    <name>СДаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоДату</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Report>

iPig/src/InformationRegisters/ЖурналОсеменения/ЖурналОсеменения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналОсеменения</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>КоличествоОпоросов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>УшнойВыщип</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ДатаАбортаОпороса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВвода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВыбытие</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОтъема</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПороды</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыОпороса</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыХряк</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыХряк1</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыХряк2</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НазваниеПородыОпороса</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НазваниеПричины</name>
    <type>
      <types>CatalogRef.Причины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотногоХряк</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотногоХряк1</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотногоХряк2</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерОпороса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОценкаСлучки</name>
    <type>
      <types>EnumRef.ОценкаСлучки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Работник</name>
    <type>
      <types>CatalogRef.Работник</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>EnumRef.Статус</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/InformationRegisters/ЖурналОтъема/ЖурналОтъема.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналОтъема</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>КоличествоОтъемышей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МассаВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СреднийВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВозрастПриПодсадке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТолщинаШпика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Мачеха</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерОпороса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодМеста</name>
    <type>
      <types>CatalogRef.Место</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВвода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/InformationRegisters/ЖурналОпороса/ЖурналОпороса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналОпороса</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Живорожденные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Мертвые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Слаборожденные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Муммии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Свинки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МассаВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СреднийВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПереведеноПоросят</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТолщинаШпика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоСосков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПороды</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерГнезда</name>
    <type>
      <types>CatalogRef.НомерГнезда</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотногоОтец</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерОпороса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>IDГнезда</name>
    <type>
      <types>CatalogRef.IDГнезда</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыОпорос</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НазваниеПородыОпорос</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВвода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Место</name>
    <type>
      <types>CatalogRef.Место</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/InformationRegisters/Аборт/Аборт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Аборт</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <dimensions>
    <name>Мачеха</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПороды</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерОпороса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВвода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/InformationRegisters/Супоросность/Супоросность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Супоросность</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ТолщинаШпика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РезультатУЗИ</name>
    <type>
      <types>EnumRef.РезультатУЗИ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Работник</name>
    <type>
      <types>CatalogRef.Работник</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерОпороса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВвода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Место</name>
    <type>
      <types>CatalogRef.Место</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/Enums/РезультатУЗИ/РезультатУЗИ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РезультатУЗИ</name>
  <enumValues>
    <name>Негативный</name>
  </enumValues>
  <enumValues>
    <name>Неизвестный</name>
  </enumValues>
  <enumValues>
    <name>Позитивный</name>
  </enumValues>
</mdclass:Enum>

iPig/src/Enums/ТипВыпадения/ТипВыпадения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипВыпадения</name>
  <enumValues>
    <name>Выбраковка</name>
  </enumValues>
  <enumValues>
    <name>Повторы</name>
  </enumValues>
  <enumValues>
    <name>ТестСупоросности</name>
  </enumValues>
  <enumValues>
    <name>Аборт</name>
  </enumValues>
</mdclass:Enum>

iPig/src/Reports/КартаПлодовитости/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура СформироватьНаСервере(ТабДок)
	ТЗВыпавшие.Очистить();
	ТабДок.Очистить();

	Макет = Отчеты.КартаПлодовитости.ПолучитьМакет("Макет");

	ОбластьШапкаНачало 		= Макет.ПолучитьОбласть("Шапка|Начало");
	ОбластьСтрокаНачало 	= Макет.ПолучитьОбласть("Строка|Начало");
	ОбластьШапкаНеделя 		= Макет.ПолучитьОбласть("Шапка|Неделя");
	ОбластьСтрокаНеделя     = Макет.ПолучитьОбласть("Строка|Неделя");
	ОбластьШапкаКонец 		= Макет.ПолучитьОбласть("Шапка|Конец");
	ОбластьСтрокаКонец      = Макет.ПолучитьОбласть("Строка|Конец");

	ОбластьШапкаНачало.Параметры.СДаты = Отчет.СДаты;
	ОбластьШапкаНачало.Параметры.ПоДату = Отчет.ПоДату;
	ТабДок.Вывести(ОбластьШапкаНачало);
	Неделя = 1;
	Пока Неделя <= 18 Цикл
		ОбластьШапкаНеделя.Параметры.НеделяСупоросности = Неделя;
		ТабДок.Присоединить(ОбластьШапкаНеделя);
		Неделя = Неделя + 1;
	КонецЦикла;
	ТабДок.Присоединить(ОбластьШапкаКонец);

	СДаты = Отчет.СДаты;
	НачНедели = НачалоНедели(СДаты);
	КонНедели = КонецНедели(СДаты);
	НомерНедели = 1;
	СДаты = СДаты + 7 * 24 * 60 * 60;
	Пока КонНедели <= КонецДня(Отчет.ПоДату) Цикл

		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЖурналОсеменения.Период КАК ДатаОсеменения,
		|	Аборт.Период КАК ДатаАборта,
		|	ЖурналОпороса.Период КАК ДатаОпороса,
		|	ЖурналОпороса.Живорожденные КАК Живорожденные,
		|	ЖурналОпороса.Мертвые КАК Мертвые,
		|	ЖурналОтъема.КоличествоОтъемышей КАК КоличествоОтъемышей,
		|	ЖурналОтъема.СреднийВес КАК СреднийВес,
		|	ЖурналОпороса.Слаборожденные КАК Слаборожденные,
		|	ЖурналОпороса.Муммии КАК Муммии,
		|	ЖурналОтъема.Период КАК ДатаОтъема,
		|	КарточкаСвиноматки.ДатаВыбытие КАК ДатаВыбытие,
		|	ЖурналОсеменения.ДатаВвода КАК ДатаВвода,
		|	ЖурналОсеменения.НомерЖивотного КАК НомерЖивотного,
		|	ЖурналОсеменения.НомерОпороса КАК НомерОпороса,
		|	Супоросность.Период КАК ДатаУЗИ,
		|	Супоросность.РезультатУЗИ КАК РезультатУЗИ
		|ИЗ
		|	РегистрСведений.ЖурналОсеменения КАК ЖурналОсеменения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КарточкаСвиноматки КАК КарточкаСвиноматки
		|		ПО ЖурналОсеменения.НомерЖивотного = КарточкаСвиноматки.НомерЖивотного
		|			И ЖурналОсеменения.НомерОпороса = КарточкаСвиноматки.НомерОпороса
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналОтъема КАК ЖурналОтъема
		|		ПО ЖурналОсеменения.НомерЖивотного = ЖурналОтъема.НомерЖивотного
		|			И ЖурналОсеменения.НомерОпороса = ЖурналОтъема.НомерОпороса
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналОпороса КАК ЖурналОпороса
		|		ПО ЖурналОсеменения.НомерЖивотного = ЖурналОпороса.НомерЖивотного
		|			И ЖурналОсеменения.НомерОпороса = ЖурналОпороса.НомерОпороса
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Аборт КАК Аборт
		|		ПО ЖурналОсеменения.НомерЖивотного = Аборт.НомерЖивотного
		|			И ЖурналОсеменения.НомерОпороса = Аборт.НомерОпороса
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Супоросность КАК Супоросность
		|		ПО ЖурналОсеменения.НомерЖивотного = Супоросность.НомерЖивотного
		|			И ЖурналОсеменения.НомерОпороса = Супоросность.НомерОпороса
		|			И ЖурналОсеменения.Период < Супоросность.Период
		|ГДЕ
		|	ЖурналОсеменения.Период МЕЖДУ &ДатаНач И &ДатаКон
		|
		|СГРУППИРОВАТЬ ПО
		|	ЖурналОсеменения.НомерЖивотного,
		|	ЖурналОсеменения.Период,
		|	Аборт.Период,
		|	ЖурналОпороса.Период,
		|	ЖурналОпороса.Живорожденные,
		|	ЖурналОпороса.Мертвые,
		|	ЖурналОтъема.КоличествоОтъемышей,
		|	ЖурналОтъема.СреднийВес,
		|	ЖурналОпороса.Слаборожденные,
		|	ЖурналОпороса.Муммии,
		|	ЖурналОтъема.Период,
		|	КарточкаСвиноматки.ДатаВыбытие,
		|	ЖурналОсеменения.ДатаВвода,
		|	ЖурналОсеменения.НомерОпороса,
		|	Супоросность.Период,
		|	Супоросность.РезультатУЗИ";
		Запрос.УстановитьПараметр("ДатаНач", НачНедели);
		Запрос.УстановитьПараметр("ДатаКон", КонНедели);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		ТЗ = РезультатЗапроса.Выгрузить();
		Свиноматки = 0;
		Свинки = 0;
		Всего = 0;
		Повторки = 0;
		НомерЖивотного = "";
		Пустые = 0;
		Повторка = 0;
		Аборт = 0;
		Выбраковка = 0;
		ОжидаемыеОпоросы = 0;
		Выбывшие = 0;
		Аборты = 0;
		СталиПовторкой = 0;
		Пусто = 0;
		КоличествоОпоросов = 0;
		ПроцентОпоросов = 0;
		ПроцентСупоросных = 0;
		ВыбраковкаОбщая = 0;
		Все = 0;
		Живые = 0;
		Мертвые = 0;
		КоличествоОтъемов = 0;
		КоличествоОтъемышей = 0;
		СрВесОтъемыша = 0;
		НачалоОжОпороса = Дата(1, 1, 1);
		КонецОжОпороса = Дата(1, 1, 1);
		Начало = НачНедели;
		Конец = КонНедели; 
		//НеделяГодаОсеменения = НеделяГода(СДаты - 7 * 24 * 60 *30) + Константы.КорректировкаНачалаГода.Получить(); 
		НеделяГодаОсеменения = _НастройкиКонфигурацииНаСервере.РасчетНомераНедели(СДаты - 7 * 24 * 60 * 30,
			Константы.НачалоОтсчетаНомераНедели.Получить());
		МассивВыбывших = Новый Массив;
		Пока Выборка.Следующий() Цикл
			Если ЗначениеЗаполнено(Выборка.ДатаОсеменения) Тогда
				//Начало
				Если Выборка.ДатаОсеменения >= НачНедели И Выборка.ДатаОсеменения <= КонНедели Тогда
					Если Выборка.НомерЖивотного <> НомерЖивотного Тогда
						Если Выборка.НомерОпороса > 1 Тогда
							Свиноматки = Свиноматки + 1;
						Иначе
							Свинки = Свинки + 1;
						КонецЕсли;
						Всего = Всего + 1;

						Запрос = Новый Запрос;
						Запрос.Текст =
						"ВЫБРАТЬ
						|	ЖурналОсеменения.НомерОпороса КАК НомерОпороса,
						|	ЖурналОсеменения.Период КАК ДатаОсеменения
						|ИЗ
						|	РегистрСведений.ЖурналОсеменения КАК ЖурналОсеменения
						|ГДЕ
						|	ЖурналОсеменения.НомерЖивотного = &НомерЖивотного
						|	И ЖурналОсеменения.НомерОпороса = &НомерОпороса";
						Запрос.УстановитьПараметр("НомерЖивотного", Выборка.НомерЖивотного);
						Запрос.УстановитьПараметр("НомерОпороса", Выборка.НомерОпороса);
						РезультатЗапроса = Запрос.Выполнить();
						ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
						ДатаОсеменения = Выборка.ДатаОсеменения;
						n=0;
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
							Если ДатаОсеменения > ВыборкаДетальныеЗаписи.ДатаОсеменения Тогда
								Повторки = Повторки + 1;
								Прервать;
							КонецЕсли;
							Если Выборка.РезультатУЗИ = Перечисления.РезультатУЗИ.Негативный Тогда
								Если Выборка.ДатаУЗИ < ТекущаяДата() Тогда
									n = n + 1;
								КонецЕсли;
							КонецЕсли;
						КонецЦикла;
						Если n >= 1 Тогда
							Пусто = Пусто + 1;
						КонецЕсли;
						//Конец				
						Опорос = Выборка.ДатаОсеменения + Константы.ПериодСупоросностиСвиноматки.Получить() * 24 * 60
							* 60;
						//	Если НЕ ЗначениеЗаполнено(Выборка.ДатаОпороса) И Опорос >= ТекущаяДата() Тогда  
						Если Не ЗначениеЗаполнено(Выборка.ДатаОпороса) Тогда
							ОжидаемыеОпоросы = ОжидаемыеОпоросы + 1;
							ПроцентСупоросных = ПроцентСупоросных + 1;
							Если Начало <= Выборка.ДатаОсеменения Тогда
								КонецОжОпороса = Выборка.ДатаОсеменения
									+ Константы.ПериодСупоросностиСвиноматки.Получить() * 24 * 60 * 60;
								Начало = Выборка.ДатаОсеменения;
							Иначе
								КонецОжОпороса = Начало + Константы.ПериодСупоросностиСвиноматки.Получить() * 24 * 60
									* 60;
							КонецЕсли;
							Если Конец >= Выборка.ДатаОсеменения Тогда
								НачалоОжОпороса = Выборка.ДатаОсеменения
									+ Константы.ПериодСупоросностиСвиноматки.Получить() * 24 * 60 * 60;
								Конец = Выборка.ДатаОсеменения;
							Иначе
								НачалоОжОпороса = Конец + Константы.ПериодСупоросностиСвиноматки.Получить() * 24 * 60
									* 60;
							КонецЕсли;
						КонецЕсли;
						Если ЗначениеЗаполнено(Выборка.ДатаВыбытие) Тогда
							МассивВыбывших.Добавить(Выборка.НомерЖивотного);
							Выбывшие = Выбывшие + 1;
						КонецЕсли;
						Если ЗначениеЗаполнено(Выборка.ДатаАборта) Тогда
							Аборты = Аборты + 1;
							//	ДобавитьСтрокуТЗВыпавшиеНаСервере(Выборка.ДатаАборта,Выборка.ДатаОсеменения, НеделяГодаОсеменения, Неделя, Выборка.НомерЖивотного, Выборка.НомерОпороса, Перечисления.ТипВыпадения.Аборт);
						КонецЕсли;
						Если ЗначениеЗаполнено(Выборка.ДатаОпороса) Тогда
							Если Выборка.ДатаОсеменения < Выборка.ДатаОпороса И Выборка.ДатаОпороса
								< Выборка.ДатаОсеменения + 18 * 7 * 24 * 60 * 60 Тогда
								КоличествоОпоросов = КоличествоОпоросов + 1;
								//	Все = Все + Выборка.Живорожденные + Выборка.Мертвые + Выборка.Слаборожденные + Выборка.Муммии;
								Все = Все + Выборка.Живорожденные + Выборка.Мертвые;
								Живые = Живые + Выборка.Живорожденные;
								Мертвые = Мертвые + Выборка.Мертвые;
								ПроцентОпоросов = ПроцентОпоросов + 1;
								Если ЗначениеЗаполнено(Выборка.ДатаОтъема) Тогда
									КоличествоОтъемов = КоличествоОтъемов + 1;
									КоличествоОтъемышей = КоличествоОтъемышей + Выборка.КоличествоОтъемышей;
									СрВесОтъемыша = СрВесОтъемыша + Выборка.СреднийВес;
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
						НомерЖивотного = Выборка.НомерЖивотного;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;

		ОбластьСтрокаНачало.Параметры.НомерНедели 	= НеделяГодаОсеменения;
		ОбластьСтрокаНачало.Параметры.Свиноматки 	= Свиноматки;
		ОбластьСтрокаНачало.Параметры.Свинки 		= Свинки;
		ОбластьСтрокаНачало.Параметры.Всего 		= Всего;
		ОбластьСтрокаНачало.Параметры.Повторки 		= Повторки;
		ТабДок.Вывести(ОбластьСтрокаНачало);
		ОжидаемыеОпоросы = Всего - Выбывшие;
		////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		Неделя = 0;
		Массив = Новый Массив;
		Массив.Добавить(Тип("Число"));
		ОписаниеТиповЧ = Новый ОписаниеТипов(Массив);

		ПовторкиСписок = Новый ТаблицаЗначений;
		ПовторкиСписок.Колонки.Добавить("Неделя", ОписаниеТиповЧ);
		ПовторкиСписок.Колонки.Добавить("Повторка", ОписаниеТиповЧ);

		ВыбраковкаСписок = Новый ТаблицаЗначений;
		ВыбраковкаСписок.Колонки.Добавить("Неделя", ОписаниеТиповЧ);
		ВыбраковкаСписок.Колонки.Добавить("Выбраковка", ОписаниеТиповЧ);

		АбортСписок = Новый ТаблицаЗначений;
		АбортСписок.Колонки.Добавить("Неделя", ОписаниеТиповЧ);
		АбортСписок.Колонки.Добавить("Аборт", ОписаниеТиповЧ);
		Пока Неделя <= 17 Цикл
			Для Каждого Строка Из ТЗ Цикл
				Если ЗначениеЗаполнено(Строка.ДатаОсеменения) Тогда
					ДатаОсем = Строка.ДатаОсеменения + Неделя * 7 * 24 * 60 * 60;
					НачНеделиОсем = НачалоНедели(ДатаОсем);
					КонНеделиОсем = КонецНедели(ДатаОсем); 
					//НачНеделиОсем = ДатаОсем;
					//КонНеделиОсем = ДатаОсем + Неделя*7*24*60*60; 
					ДатаОсеменения = Строка.ДатаОсеменения;
					ДатаОс = Строка.ДатаОсеменения;
					Если Строка.ДатаОсеменения >= НачНеделиОсем И Строка.ДатаОсеменения <= КонНеделиОсем Тогда                   
						//Неделя	 

						Если Строка.НомерЖивотного <> НомерЖивотного Тогда
							Запрос = Новый Запрос;
							Запрос.Текст =
							"ВЫБРАТЬ
							|	ЖурналОсеменения.НомерОпороса КАК НомерОпороса,
							|	ЖурналОсеменения.Период КАК ДатаОсеменения,
							|	Супоросность.Период КАК Период,
							|	Супоросность.РезультатУЗИ КАК РезультатУЗИ
							|ПОМЕСТИТЬ ТЧДанные
							|ИЗ
							|	РегистрСведений.ЖурналОсеменения КАК ЖурналОсеменения
							|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Супоросность КАК Супоросность
							|		ПО ЖурналОсеменения.НомерЖивотного = Супоросность.НомерЖивотного
							|			И ЖурналОсеменения.НомерОпороса = Супоросность.НомерОпороса
							|			И ЖурналОсеменения.Период < Супоросность.Период
							|ГДЕ
							|	ЖурналОсеменения.НомерЖивотного = &НомерЖивотного
							|	И ЖурналОсеменения.НомерОпороса = &НомерОпороса
							|	И (Супоросность.РезультатУЗИ ЕСТЬ NULL
							|		ИЛИ Супоросность.РезультатУЗИ = ЗНАЧЕНИЕ(Перечисление.РезультатУЗИ.Позитивный)
							|		ИЛИ Супоросность.РезультатУЗИ = ЗНАЧЕНИЕ(Перечисление.РезультатУЗИ.Неизвестный))
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	ТЧДанные.НомерОпороса КАК НомерОпороса,
							|	ТЧДанные.ДатаОсеменения КАК ДатаОсеменения,
							|	ТЧДанные.Период КАК Период,
							|	ТЧДанные.РезультатУЗИ КАК РезультатУЗИ
							|ПОМЕСТИТЬ ТЧУЗИ
							|ИЗ
							|	ТЧДанные КАК ТЧДанные
							|ГДЕ
							|	НЕ ТЧДанные.Период ЕСТЬ NULL
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ РАЗЛИЧНЫЕ
							|	ТЧДанные.НомерОпороса КАК НомерОпороса,
							|	ТЧДанные.ДатаОсеменения КАК ДатаОсеменения,
							|	ТЧУЗИ.Период КАК Период,
							|	ТЧУЗИ.РезультатУЗИ КАК РезультатУЗИ
							|ПОМЕСТИТЬ ВТРезультат
							|ИЗ
							|	ТЧДанные КАК ТЧДанные
							|		ЛЕВОЕ СОЕДИНЕНИЕ ТЧУЗИ КАК ТЧУЗИ
							|		ПО (ТЧУЗИ.ДатаОсеменения <= ТЧДанные.ДатаОсеменения)
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	ВТРезультат.НомерОпороса КАК НомерОпороса,
							|	ВТРезультат.ДатаОсеменения КАК ДатаОсеменения,
							|	ВТРезультат.Период КАК Период,
							|	ВТРезультат.РезультатУЗИ КАК РезультатУЗИ
							|ИЗ
							|	ВТРезультат КАК ВТРезультат
							|ГДЕ
							|	(ВТРезультат.РезультатУЗИ ЕСТЬ NULL
							|			ИЛИ ВТРезультат.РезультатУЗИ = ЗНАЧЕНИЕ(Перечисление.РезультатУЗИ.Позитивный)
							|			ИЛИ ВТРезультат.РезультатУЗИ = ЗНАЧЕНИЕ(Перечисление.РезультатУЗИ.Неизвестный))";
							Запрос.УстановитьПараметр("НомерЖивотного", Строка.НомерЖивотного);
							Запрос.УстановитьПараметр("НомерОпороса", Строка.НомерОпороса);
							РезультатЗапроса = Запрос.Выполнить();
							ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
							Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
								Если (ДатаОс >= НачНеделиОсем И ДатаОС <= КонНеделиОсем) И ДатаОс
									< ВыборкаДетальныеЗаписи.ДатаОсеменения Тогда
									НоваяСтрока = ПовторкиСписок.Добавить();
									НоваяСтрока.Неделя = ЦЕЛ((ВыборкаДетальныеЗаписи.ДатаОсеменения - ДатаОс) / (24 * 60
										* 60 * 7));
									ПоискВыбывших = МассивВыбывших.Найти(Строка.НомерЖивотного);
									Если ПоискВыбывших = Неопределено Тогда
										НоваяСтрока.Повторка = 1;
									КонецЕсли;
									ДобавитьСтрокуТЗВыпавшиеНаСервере(ВыборкаДетальныеЗаписи.ДатаОсеменения, ДатаОс,
										НеделяГодаОсеменения, НоваяСтрока.Неделя, Строка.НомерЖивотного,
										Строка.НомерОпороса, Перечисления.ТипВыпадения.Повторы);

									ДатаОс = ВыборкаДетальныеЗаписи.ДатаОсеменения;
								КонецЕсли;
							КонецЦикла;
							НомерЖивотного = Строка.НомерЖивотного;
						КонецЕсли;
						Если ЗначениеЗаполнено(Строка.ДатаАборта) Тогда
							Если Строка.ДатаОсеменения >= НачНеделиОсем И Строка.ДатаОсеменения <= КонНеделиОсем Тогда

								НоваяСтрока 		= АбортСписок.Добавить(); 
								//НоваяСтрока.Неделя 	= ЦЕЛ((ВыборкаДетальныеЗаписи.ДатаОсеменения - Строка.ДатаАборта)/(24*60*60*7));   
								НоваяСтрока.Неделя 	= ЦЕЛ((Строка.ДатаАборта - Строка.ДатаОсеменения) / (24 * 60 * 60
									* 7));
								ПоискВыбывших = МассивВыбывших.Найти(Строка.НомерЖивотного);
								Если ПоискВыбывших = Неопределено Тогда
									НоваяСтрока.Аборт 	= 1;
								КонецЕсли;
								ДобавитьСтрокуТЗВыпавшиеНаСервере(Строка.ДатаАборта, Строка.ДатаОсеменения,
									НеделяГодаОсеменения, НоваяСтрока.Неделя, Строка.НомерЖивотного,
									Строка.НомерОпороса, Перечисления.ТипВыпадения.Аборт);
							КонецЕсли;
						КонецЕсли;
						Если ЗначениеЗаполнено(Строка.ДатаВыбытие) И Не ЗначениеЗаполнено(Строка.ДатаОпороса)
							И Не ЗначениеЗаполнено(Строка.ДатаУЗИ) Тогда

							Запрос = Новый Запрос;
							Запрос.Текст =
							"ВЫБРАТЬ
							|	ЖурналОсеменения.НомерОпороса КАК НомерОпороса,
							|	ЖурналОсеменения.Период КАК Период
							|ИЗ
							|	РегистрСведений.ЖурналОсеменения КАК ЖурналОсеменения
							|ГДЕ
							|	ЖурналОсеменения.НомерЖивотного = &НомерЖивотного
							|	И ЖурналОсеменения.Период МЕЖДУ &ДатаНач И &ДатаКон";

							Запрос.УстановитьПараметр("ДатаКон", Строка.ДатаВыбытие);
							Запрос.УстановитьПараметр("ДатаНач", Строка.ДатаОсеменения);
							Запрос.УстановитьПараметр("НомерЖивотного", Строка.НомерЖивотного);

							РезультатЗапроса = Запрос.Выполнить();

							КоличествоОсеменений = РезультатЗапроса.Выбрать().Количество();

							Если Строка.ДатаОсеменения >= НачНеделиОсем И Строка.ДатаОсеменения <= КонНеделиОсем
								И КоличествоОсеменений = 1 Тогда
								НоваяСтрока = ВыбраковкаСписок.Добавить();
								НоваяСтрока.Неделя = ЦЕЛ((Строка.ДатаВыбытие - Строка.ДатаОсеменения) / (24 * 60 * 60
									* 7));
								ПоискВыбывших = МассивВыбывших.Найти(Строка.НомерЖивотного);
								Если ПоискВыбывших = Неопределено Тогда
									НоваяСтрока.Выбраковка = 1;
								КонецЕсли;
								ДобавитьСтрокуТЗВыпавшиеНаСервере(Строка.ДатаВыбытие, Строка.ДатаОсеменения,
									НеделяГодаОсеменения, НоваяСтрока.Неделя, Строка.НомерЖивотного,
									Строка.НомерОпороса, Перечисления.ТипВыпадения.Выбраковка);
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					Запрос = Новый Запрос;
					Запрос.Текст =
					"ВЫБРАТЬ
					|	ЖурналОсеменения.НомерОпороса КАК НомерОпороса,
					|	ЖурналОсеменения.Период КАК Период
					|ИЗ
					|	РегистрСведений.ЖурналОсеменения КАК ЖурналОсеменения
					|ГДЕ
					|	ЖурналОсеменения.НомерЖивотного = &НомерЖивотного
					|	И ЖурналОсеменения.Период МЕЖДУ &ДатаНач И &ДатаКон";

					Запрос.УстановитьПараметр("ДатаКон", Строка.ДатаУЗИ);
					Запрос.УстановитьПараметр("ДатаНач", Строка.ДатаОсеменения);
					Запрос.УстановитьПараметр("НомерЖивотного", Строка.НомерЖивотного);

					РезультатЗапроса = Запрос.Выполнить();

					КоличествоОсеменений = РезультатЗапроса.Выбрать().Количество();

					Если Строка.РезультатУЗИ = Перечисления.РезультатУЗИ.Негативный И ЦЕЛ((Строка.ДатаУЗИ
						- Строка.ДатаОсеменения) / (24 * 60 * 60 * 7)) = Неделя Тогда //И КоличествоОсеменений = 1 Тогда
						РезультатПоиска = ТЗВыпавшие.НайтиСтроки(Новый Структура("НомерЖивотного, НеделяОсеменения",
							Строка.НомерЖивотного, НеделяГодаОсеменения));
						Если РезультатПоиска.Количество() = 0 Тогда
							ПоискВыбывших = МассивВыбывших.Найти(Строка.НомерЖивотного);
							Если ПоискВыбывших = Неопределено Тогда
								Пустые = Пустые + 1;
							КонецЕсли;
							ДобавитьСтрокуТЗВыпавшиеНаСервере(Строка.ДатаУЗИ, Строка.ДатаОсеменения,
								НеделяГодаОсеменения, Неделя, Строка.НомерЖивотного, Строка.НомерОпороса,
								Перечисления.ТипВыпадения.ТестСупоросности);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			ОбластьСтрокаНеделя.Параметры.Пустые = Пустые;

			ОбластьСтрокаНеделя.Параметры.Повторка = 0;
			ПовторкиСписок.Свернуть("Неделя", "Повторка");
			НайденныеСтроки = ПовторкиСписок.НайтиСтроки(Новый Структура("Неделя", Неделя));
			Для Каждого Стр Из НайденныеСтроки Цикл
				ОбластьСтрокаНеделя.Параметры.Повторка = Стр.Повторка;
				Повторка = Повторка + Стр.Повторка;
			КонецЦикла;

			ОбластьСтрокаНеделя.Параметры.Аборт = 0;
			АбортСписок.Свернуть("Неделя", "Аборт");
			НайденныеСтроки = АбортСписок.НайтиСтроки(Новый Структура("Неделя", Неделя));
			Для Каждого Стр Из НайденныеСтроки Цикл
				ОбластьСтрокаНеделя.Параметры.Аборт = Стр.Аборт;
				Аборт = Аборт + Стр.Аборт;
			КонецЦикла;
			ОбластьСтрокаНеделя.Параметры.Выбраковка =  0;
			ВыбраковкаСписок.Свернуть("Неделя", "Выбраковка");
			НайденныеСтроки = ВыбраковкаСписок.НайтиСтроки(Новый Структура("Неделя", Неделя));
			Для Каждого Стр Из НайденныеСтроки Цикл
				ОбластьСтрокаНеделя.Параметры.Выбраковка = Стр.Выбраковка;
				Выбраковка = Выбраковка + Стр.Выбраковка;
			КонецЦикла;
			ВыбраковкаОбщая = ВыбраковкаОбщая + Выбраковка;

			ТабДок.Присоединить(ОбластьСтрокаНеделя);
			//ОжидаемыеОпоросы  = ОжидаемыеОпоросы - Пустые - Повторка - Выбраковка - Аборт; 
			ОжидаемыеОпоросы  = ОжидаемыеОпоросы - Пустые - Повторка - Аборт;
			СталиПовторкой = СталиПовторкой + Повторка;
			Пустые = 0;
			Повторка = 0;
			Аборт = 0;
			Выбраковка = 0;
			НомерЖивотного = "";
			Неделя = Неделя + 1;
		КонецЦикла;

		ОбластьСтрокаКонец.Параметры.ОжидаемыеОпоросы = ?(ОжидаемыеОпоросы - КоличествоОпоросов < 0, 0,
			ОжидаемыеОпоросы - КоличествоОпоросов);
		ОбластьСтрокаКонец.Параметры.Аборты = Аборты;
		ОбластьСтрокаКонец.Параметры.СталиПовторкой = СталиПовторкой;
		ОбластьСтрокаКонец.Параметры.Пусто = Пусто;
		ОбластьСтрокаКонец.Параметры.КоличествоОпоросов = КоличествоОпоросов;
		Если Всего <> 0 И ОжидаемыеОпоросы - КоличествоОпоросов > 0 Тогда
			ОбластьСтрокаКонец.Параметры.ПроцентСупоросных = ОКР((ОжидаемыеОпоросы - КоличествоОпоросов) * 100 / Всего,
				2);
			ОбластьСтрокаКонец.Параметры.НачалоОжОпороса = НачалоОжОпороса;
			ОбластьСтрокаКонец.Параметры.КонецОжОпороса = КонецОжОпороса;
		Иначе
			ОбластьСтрокаКонец.Параметры.ПроцентСупоросных = 0;
			ОбластьСтрокаКонец.Параметры.НачалоОжОпороса = "";
			ОбластьСтрокаКонец.Параметры.КонецОжОпороса = "";
		КонецЕсли;

		Если Всего <> 0 Тогда
			ОбластьСтрокаКонец.Параметры.ПроцентОпоросов = ОКР(ПроцентОпоросов * 100 / Всего, 2);
		Иначе
			ОбластьСтрокаКонец.Параметры.ПроцентОпоросов = 0;
		КонецЕсли;

		Если КоличествоОпоросов <> 0 Тогда
			ОбластьСтрокаКонец.Параметры.Все = Формат(Все / КоличествоОпоросов, "ЧДЦ=2");
			ОбластьСтрокаКонец.Параметры.Живые = Формат(Живые / КоличествоОпоросов, "ЧДЦ=2");
			ОбластьСтрокаКонец.Параметры.Мертвые = Формат(Мертвые / КоличествоОпоросов, "ЧДЦ=2");
		Иначе
			ОбластьСтрокаКонец.Параметры.Все = 0;
			ОбластьСтрокаКонец.Параметры.Живые = 0;
			ОбластьСтрокаКонец.Параметры.Мертвые = 0;
		КонецЕсли;

		Если КоличествоОтъемов <> 0 Тогда
			ОбластьСтрокаКонец.Параметры.КоличествоОтъемышей = КоличествоОтъемышей / КоличествоОтъемов;
			ОбластьСтрокаКонец.Параметры.СрВесОтъемыша = СрВесОтъемыша / КоличествоОтъемов;
		Иначе
			ОбластьСтрокаКонец.Параметры.КоличествоОтъемышей = 0;
			ОбластьСтрокаКонец.Параметры.СрВесОтъемыша = 0;
		КонецЕсли;

		ОбластьСтрокаКонец.Параметры.НачалоНедели = НачНедели;
		ОбластьСтрокаКонец.Параметры.КонецНедели = КонНедели;

		ТабДок.Присоединить(ОбластьСтрокаКонец);
		НомерНедели = НомерНедели + 1;
		НачНедели = НачалоНедели(СДаты);
		КонНедели = КонецНедели(СДаты);
		СДаты = СДаты + 7 * 24 * 60 * 60;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуТЗВыпавшиеНаСервере(Знач ДатаВыпадения, Знач ДатаОсеменения, Знач НеделяГодаОсеменения,
	Знач Неделя, Знач НомерЖивотного, Знач НомерОпороса, Знач ТипВыпадения)

	Перем ТЗНоваяСтрока;

	ТЗНоваяСтрока = ТЗВыпавшие.Добавить();
	ТЗНоваяСтрока.НомерНедели 		= Неделя + Константы.КорректировкаНачалаГода.Получить();
	ТЗНоваяСтрока.ТипВыпадения 		= ТипВыпадения;
	ТЗНоваяСтрока.НомерЖивотного 	= НомерЖивотного;
	ТЗНоваяСтрока.НомерОпороса      = НомерОпороса;
	ТЗНоваяСтрока.ДатаВыпадения     = ДатаВыпадения;
	ТЗНоваяСтрока.ДатаОсеменения    = ДатаОсеменения;
	ТЗНоваяСтрока.НеделяОсеменения  = НеделяГодаОсеменения;
	ТЗНоваяСтрока.Дни				= (ДатаВыпадения - ДатаОсеменения) / (24 * 60 * 60);

КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)           
	//	ТабДок = Новый ТабличныйДокумент;
	СформироватьНаСервере(ТабДок);
	ТабДок.ОтображатьСетку 		= Ложь;
	ТабДок.Защита 				= Ложь;
	ТабДок.ТолькоПросмотр 		= Ложь;
	ТабДок.ОтображатьЗаголовки 	= Ложь;
	ТабДок.ОриентацияСтраницы 	= ОриентацияСтраницы.Ландшафт;
	//ТабДок.АвтоМасштаб			= Истина;  
	ТабДок.МасштабПечати =     89;

КонецПроцедуры

&НаКлиенте
Процедура СДатыПриИзменении(Элемент)
	Отчет.СДаты = НачалоНедели(Отчет.СДаты);
	Если Отчет.ПоДату = '00010101000000' Тогда
		Отчет.ПоДату = КонецНедели(Отчет.СДаты);
	Иначе
		Отчет.ПоДату = КонецНедели(Отчет.ПоДату);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоДатуПриИзменении(Элемент)
	Отчет.ПоДату = КонецНедели(Отчет.ПоДату);
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериодаПриИзменении(Элемент)
	Неделя = 7 * 24 * 60 * 60;
	День   = 24 * 60 * 60;
	Месяц  = 30 * День;
	КонецНедели  = НачалоНедели(ТекущаяДата()) - 1 * День;
	Если ВыборПериода = 1 Тогда
		Отчет.ПоДату = КонецНедели;
		Отчет.СДаты  = НачалоНедели(Отчет.ПоДату);
	ИначеЕсли ВыборПериода = 2 Тогда
		Отчет.ПоДату = КонецНедели;
		Отчет.СДаты  = КонецНедели - 4 * Неделя + День;
	ИначеЕсли ВыборПериода = 3 Тогда
		Отчет.ПоДату = КонецНедели;
		Отчет.СДаты  = КонецНедели - 13 * Неделя + День;
	ИначеЕсли ВыборПериода = 4 Тогда
		КонецНедели  = НачалоНедели(ТекущаяДата()) - 1 * День;
		Отчет.ПоДату = КонецНедели;
		Отчет.СДаты  = КонецНедели - 26 * Неделя + День;
	ИначеЕсли ВыборПериода = 5 Тогда
		КонецМесяца  = НачалоМесяца(ТекущаяДата()) - 1 * День;
		Отчет.ПоДату = КонецНедели(КонецМесяца);
		Отчет.СДаты  = НачалоНедели(НачалоМесяца(КонецМесяца));
	ИначеЕсли ВыборПериода = 6 Тогда
		КонецМесяца  = НачалоМесяца(ТекущаяДата()) - 1 * День;
		Отчет.ПоДату = КонецНедели(КонецМесяца);
		Отчет.СДаты  = НачалоНедели(НачалоМесяца(КонецМесяца - 3 * Месяц));
	ИначеЕсли ВыборПериода = 7 Тогда
		КонецМесяца  = НачалоМесяца(ТекущаяДата()) - 1 * День;
		Отчет.ПоДату = КонецНедели(КонецМесяца);
		Отчет.СДаты  = НачалоНедели(НачалоМесяца(КонецМесяца - 6 * Месяц));
	ИначеЕсли ВыборПериода = 8 Тогда
		КонецМесяца  = НачалоМесяца(ТекущаяДата()) - 1 * День;
		Отчет.ПоДату = КонецНедели(КонецМесяца);
		Отчет.СДаты  = НачалоНедели(НачалоМесяца(КонецМесяца - 12 * Месяц));
	КонецЕсли;
КонецПроцедуры
